from db.constants import OTHER, MAN, WOMAN, PHOTO_LIMIT


UK_INITIAL_MESSAGE = """<b>Вас вітає Perfect Match</b>\n
До початку вашого пошуку залишилось всього кілька кроків. Розпочнімо?"""

UK_INTERNET_WARNING = 'Будьте обережні спілкуючись в інтернеті. Іноді люди можуть видавати себе за інших,\
раджу вам сприймати все з нотками сумніву.'

ASK_NAME_MESSAGE = 'Як до вас звертатися?'
ASK_AGE_MESSAGE = 'Скільки вам років?'
ASK_GENDER_MESSAGE = 'Оберіть вашу стать'
ASK_LOOKING_FOR_MESSAGE = 'Кого ви бажаєте знайти?'
ASK_CITY_MESSAGE = 'З якого ви міста?'
ASK_DESCRIPTION = 'Коротко опишіть себе. Можете розповісти про свої хобі, чого очікуєте від людини яку шукаєте і так далі.'
ASK_PHOTOS = f'Надішліть не більше ніж {PHOTO_LIMIT} фото.'

INITIAL_MESSAGE_RESPONSE = 'Вперед 👌'
INTERNET_WARNING_RESPONSE = 'Так, розумію 👍'

UKNOWN_RESPONSE = 'Незрозуміла відповідь :('

NOT_A_NUMBER = 'Ваша відповідь не є числом. Спробуйте ще раз.'

PHOTO_IS_REQUIRED = "Фото є обов'язковим. Якщо ви не бажаєте публікувати своє власне фото, раджу обрати картинку яка вас характеризує."
TOO_MANY_PHOTOS = f'Ви надіслали надто багато фото. Допустима кількість: {PHOTO_LIMIT}.\
\nПроте не хвилюйтесь, я зберіг ваші фото, які не перевищили ліміт.'
CHANGE_PHOTOS_MESSAGE = 'Всі ваші фото видалені. Тепер надішліть нові.'
PHOTOS_SAVED_MESSAGE = 'Ваші фото збережені :)'

GENDER_MESSAGE_RESPONSES = {
    MAN: 'Хлопець 👨',
    WOMAN: 'Дівчина 👩',
    OTHER: 'Не важливо'
}
WRONG_GENDER_MESSAGE = 'Будь ласка, Оберіть стать використовуючи одну з кнопок.'

SETUP_DONE_MESSAGE = 'Для початку вашого поушку використайте команду `/команда_ще_не_існує`.'
